apache/nuttx/arch/arm/src/stm32l4/stm32l4_usbdev.c
/* Byte ordering in host-based values */

#ifdef CONFIG_ENDIAN_BIG
#  define LSB 1
#  define MSB 0
#else
#  define LSB 0
#  define MSB 1
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The various states of a control pipe */

enum stm32l4_ep0state_e
{
  EP0STATE_IDLE = 0,        /* No request in progress */
  EP0STATE_SETUP_OUT,       /* Set up received with data for device OUT in progress */
  EP0STATE_SETUP_READY,     /* Set up was received prior and is in ctrl,
                             * now the data has arrived */
  EP0STATE_WRREQUEST,       /* Write request in progress */
  EP0STATE_RDREQUEST,       /* Read request in progress */
  EP0STATE_STALLED          /* We are stalled */
};

/* Resume states */

enum stm32l4_rsmstate_e
{
  RSMSTATE_IDLE = 0,        /* Device is either fully suspended or running */
  RSMSTATE_STARTED,         /* Resume sequence has been started */
  RSMSTATE_WAITING          /* Waiting (on ESOFs) for end of sequence */
};

union wb_u
{
  uint16_t w;
  uint8_t  b[2];
};

/* A container for a request so that the request make be retained in a list */

struct stm32l4_req_s
{
  struct usbdev_req_s    req;           /* Standard USB request */
  struct stm32l4_req_s  *flink;         /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct stm32l4_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct stm32l4_ep_s.
   */

  struct usbdev_ep_s     ep;            /* Standard endpoint structure */

  /* STM32-specific fields */

  struct stm32l4_usbdev_s *dev;           /* Reference to private driver data */
  struct stm32l4_req_s    *head;          /* Request list for this endpoint */
  struct stm32l4_req_s    *tail;
  uint8_t                  bufno;         /* Allocated buffer number */
  uint8_t                  stalled:1;     /* true: Endpoint is stalled */
  uint8_t                  halted:1;      /* true: Endpoint feature halted */
  uint8_t                  txbusy:1;      /* true: TX endpoint FIFO full */
  uint8_t                  txnullpkt:1;   /* Null packet needed at end of transfer */
};

struct stm32l4_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to structstm32l4_usbdev_s.
   */

  struct usbdev_s usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* STM32-specific fields */

  uint8_t                ep0state;      /* State of EP0 (see enum stm32l4_ep0state_e) */
  uint8_t                rsmstate;      /* Resume state (see enum stm32l4_rsmstate_e) */
  uint8_t                nesofs;        /* ESOF counter (for resume support) */
  uint8_t                rxpending:1;   /* 1: OUT data in PMA, but no read requests */
  uint8_t                selfpowered:1; /* 1: Device is self powered */
  uint8_t                epavail;       /* Bitset of available endpoints */
  uint8_t                bufavail;      /* Bitset of available buffers */
  uint16_t               rxstatus;      /* Saved during interrupt processing */
  uint16_t               txstatus;      /* "   " "    " "       " "        " */
  uint16_t               imask;         /* Current interrupt mask */

  /* E0 SETUP data buffering.
   *
   * ctrl
   *   The 8-byte SETUP request is received on the EP0 OUT endpoint and is
   *   saved.
   *
   * ep0data
   *   For OUT SETUP requests, the SETUP data phase must also complete before
   *   the SETUP command can be processed.  The ep0 packet receipt logic
   *   stm32l4_ep0_rdrequest will save the accompanying EP0 OUT data in
   *   ep0data[] before the SETUP command is re-processed.
   *
   * ep0datlen
   *   Length of OUT DATA received in ep0data[]
   */

  struct usb_ctrlreq_s   ctrl;          /* Last EP0 request */

  uint8_t                ep0data[CONFIG_USBDEV_SETUP_MAXDATASIZE];
  uint16_t               ep0datlen;

  /* The endpoint list */

  struct stm32l4_ep_s      eplist[STM32_NENDPOINTS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#ifdef CONFIG_STM32L4_USBDEV_REGDEBUG
static uint16_t stm32l4_getreg(uint32_t addr);
static void stm32l4_putreg(uint16_t val, uint32_t addr);
static void stm32l4_checksetup(void);
static void stm32l4_dumpep(int epno);
#else
#  define stm32l4_getreg(addr)     getreg16(addr)
#  define stm32l4_putreg(val,addr) putreg16(val,addr)
#  define stm32l4_checksetup()
#  define stm32l4_dumpep(epno)
#endif

/* Low-Level Helpers ********************************************************/

static inline void
              stm32l4_seteptxcount(uint8_t epno, uint16_t count);
static inline void
              stm32l4_seteptxaddr(uint8_t epno, uint16_t addr);
static inline uint16_t
              stm32l4_geteptxaddr(uint8_t epno);
static void   stm32l4_seteprxcount(uint8_t epno, uint16_t count);
static inline uint16_t
              stm32l4_geteprxcount(uint8_t epno);
static inline void
              stm32l4_seteprxaddr(uint8_t epno, uint16_t addr);
static inline uint16_t
              stm32l4_geteprxaddr(uint8_t epno);
static inline void
              stm32l4_setepaddress(uint8_t epno, uint16_t addr);
static inline void
              stm32l4_seteptype(uint8_t epno, uint16_t type);
static inline void
              stm32l4_seteptxaddr(uint8_t epno, uint16_t addr);
static inline void
              stm32l4_setstatusout(uint8_t epno);
static inline void
              stm32l4_clrstatusout(uint8_t epno);
static void   stm32l4_clrrxdtog(uint8_t epno);
static void   stm32l4_clrtxdtog(uint8_t epno);
static void   stm32l4_clrepctrrx(uint8_t epno);
static void   stm32l4_clrepctrtx(uint8_t epno);
static void   stm32l4_seteptxstatus(uint8_t epno, uint16_t state);
static void   stm32l4_seteprxstatus(uint8_t epno, uint16_t state);
static inline uint16_t
              stm32l4_geteptxstatus(uint8_t epno);
static inline uint16_t
              stm32l4_geteprxstatus(uint8_t epno);
static bool   stm32l4_eptxstalled(uint8_t epno);
static bool   stm32l4_eprxstalled(uint8_t epno);
static void   stm32l4_setimask(struct stm32l4_usbdev_s *priv,
                               uint16_t setbits,
                               uint16_t clrbits);

