apache/nuttx/arch/arm/src/stm32l4/stm32l4_usbdev.c
/* Suspend/Resume Helpers ***************************************************/

static void   stm32l4_suspend(struct stm32l4_usbdev_s *priv);
static void   stm32l4_initresume(struct stm32l4_usbdev_s *priv);
static void   stm32l4_esofpoll(struct stm32l4_usbdev_s *priv) ;

/* Request Helpers **********************************************************/

static void   stm32l4_copytopma(const uint8_t *buffer, uint16_t pma,
                                uint16_t nbytes);
static inline void
              stm32l4_copyfrompma(uint8_t *buffer, uint16_t pma,
                                  uint16_t nbytes);
static struct stm32l4_req_s *
              stm32l4_rqdequeue(struct stm32l4_ep_s *privep);
static void   stm32l4_rqenqueue(struct stm32l4_ep_s *privep,
                                struct stm32l4_req_s *req);
static inline void
              stm32l4_abortrequest(struct stm32l4_ep_s *privep,
                                   struct stm32l4_req_s *privreq,
                                   int16_t result);
static void   stm32l4_reqcomplete(struct stm32l4_ep_s *privep,
                                  int16_t result);
static void   stm32l4_epwrite(struct stm32l4_usbdev_s *buf,
                              struct stm32l4_ep_s *privep,
                              const uint8_t *data, uint32_t nbytes);
static int    stm32l4_wrrequest(struct stm32l4_usbdev_s *priv,
                                struct stm32l4_ep_s *privep);
inline static int
              stm32l4_wrrequest_ep0(struct stm32l4_usbdev_s *priv,
                                    struct stm32l4_ep_s *privep);
static inline int
              stm32l4_ep0_rdrequest(struct stm32l4_usbdev_s *priv);
static int    stm32l4_rdrequest(struct stm32l4_usbdev_s *priv,
                                struct stm32l4_ep_s *privep);
static void   stm32l4_cancelrequests(struct stm32l4_ep_s *privep);

/* Interrupt level processing ***********************************************/

static void   stm32l4_dispatchrequest(struct stm32l4_usbdev_s *priv);
static void   stm32l4_epdone(struct stm32l4_usbdev_s *priv, uint8_t epno);
static void   stm32l4_setdevaddr(struct stm32l4_usbdev_s *priv,
                                 uint8_t value);
static void   stm32l4_ep0setup(struct stm32l4_usbdev_s *priv);
static void   stm32l4_ep0out(struct stm32l4_usbdev_s *priv);
static void   stm32l4_ep0in(struct stm32l4_usbdev_s *priv);
static inline void
              stm32l4_ep0done(struct stm32l4_usbdev_s *priv, uint16_t istr);
static void   stm32l4_lptransfer(struct stm32l4_usbdev_s *priv);
static int    stm32l4_usbinterrupt(int irq, void *context, void *arg);

/* Endpoint helpers *********************************************************/

static inline struct stm32l4_ep_s *
              stm32l4_epreserve(struct stm32l4_usbdev_s *priv,
                                uint8_t epset);
static inline void
              stm32l4_epunreserve(struct stm32l4_usbdev_s *priv,
                struct stm32l4_ep_s *privep);
static inline bool
              stm32l4_epreserved(struct stm32l4_usbdev_s *priv, int epno);
static int    stm32l4_epallocpma(struct stm32l4_usbdev_s *priv);
static inline void
              stm32l4_epfreepma(struct stm32l4_usbdev_s *priv,
                struct stm32l4_ep_s *privep);

/* Endpoint operations ******************************************************/

static int    stm32l4_epconfigure(struct usbdev_ep_s *ep,
                const struct usb_epdesc_s *desc, bool last);
static int    stm32l4_epdisable(struct usbdev_ep_s *ep);
static struct usbdev_req_s *
              stm32l4_epallocreq(struct usbdev_ep_s *ep);
static void   stm32l4_epfreereq(struct usbdev_ep_s *ep,
                struct usbdev_req_s *);
static int    stm32l4_epsubmit(struct usbdev_ep_s *ep,
                struct usbdev_req_s *req);
static int    stm32l4_epcancel(struct usbdev_ep_s *ep,
                struct usbdev_req_s *req);
static int    stm32l4_epstall(struct usbdev_ep_s *ep, bool resume);

/* USB device controller operations *****************************************/

static struct usbdev_ep_s *
              stm32l4_allocep(struct usbdev_s *dev, uint8_t epno, bool in,
                uint8_t eptype);
static void   stm32l4_freeep(struct usbdev_s *dev, struct usbdev_ep_s *ep);
static int    stm32l4_getframe(struct usbdev_s *dev);
static int    stm32l4_wakeup(struct usbdev_s *dev);
static int    stm32l4_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int    stm32l4_pullup(struct usbdev_s *dev, bool enable);

/* Initialization/Reset *****************************************************/

static void   stm32l4_reset(struct stm32l4_usbdev_s *priv);
static void   stm32l4_hwreset(struct stm32l4_usbdev_s *priv);
static void   stm32l4_hwsetup(struct stm32l4_usbdev_s *priv);
static void   stm32l4_hwshutdown(struct stm32l4_usbdev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct stm32l4_usbdev_s g_usbdev;

static const struct usbdev_epops_s g_epops =
{
  .configure   = stm32l4_epconfigure,
  .disable     = stm32l4_epdisable,
  .allocreq    = stm32l4_epallocreq,
  .freereq     = stm32l4_epfreereq,
  .submit      = stm32l4_epsubmit,
  .cancel      = stm32l4_epcancel,
  .stall       = stm32l4_epstall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep     = stm32l4_allocep,
  .freeep      = stm32l4_freeep,
  .getframe    = stm32l4_getframe,
  .wakeup      = stm32l4_wakeup,
  .selfpowered = stm32l4_selfpowered,
  .pullup      = stm32l4_pullup,
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(STM32_TRACEINTID_CLEARFEATURE),
  TRACE_STR(STM32_TRACEINTID_DEVGETSTATUS),
  TRACE_STR(STM32_TRACEINTID_DISPATCH),
  TRACE_STR(STM32_TRACEINTID_EP0IN),
  TRACE_STR(STM32_TRACEINTID_EP0INDONE),
  TRACE_STR(STM32_TRACEINTID_EP0OUTDONE),
  TRACE_STR(STM32_TRACEINTID_EP0SETUPDONE),
  TRACE_STR(STM32_TRACEINTID_EP0SETUPSETADDRESS),
  TRACE_STR(STM32_TRACEINTID_EPGETSTATUS),
  TRACE_STR(STM32_TRACEINTID_EPINDONE),
  TRACE_STR(STM32_TRACEINTID_EPINQEMPTY),
  TRACE_STR(STM32_TRACEINTID_EPOUTDONE),
  TRACE_STR(STM32_TRACEINTID_EPOUTPENDING),
  TRACE_STR(STM32_TRACEINTID_EPOUTQEMPTY),
  TRACE_STR(STM32_TRACEINTID_ESOF),
  TRACE_STR(STM32_TRACEINTID_GETCONFIG),
  TRACE_STR(STM32_TRACEINTID_GETSETDESC),
  TRACE_STR(STM32_TRACEINTID_GETSETIF),
  TRACE_STR(STM32_TRACEINTID_GETSTATUS),
  TRACE_STR(STM32_TRACEINTID_IFGETSTATUS),
  TRACE_STR(STM32_TRACEINTID_USBCTR),
  TRACE_STR(STM32_TRACEINTID_USBINTERRUPT),
  TRACE_STR(STM32_TRACEINTID_NOSTDREQ),
  TRACE_STR(STM32_TRACEINTID_RESET),
  TRACE_STR(STM32_TRACEINTID_SETCONFIG),
  TRACE_STR(STM32_TRACEINTID_SETFEATURE),
  TRACE_STR(STM32_TRACEINTID_SUSP),
  TRACE_STR(STM32_TRACEINTID_SYNCHFRAME),
  TRACE_STR(STM32_TRACEINTID_WKUP),
  TRACE_STR(STM32_TRACEINTID_EP0SETUPOUT),
  TRACE_STR(STM32_TRACEINTID_EP0SETUPOUTDATA),
  TRACE_STR_END
};
#endif

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(STM32_TRACEERR_ALLOCFAIL),
  TRACE_STR(STM32_TRACEERR_BADCLEARFEATURE),
  TRACE_STR(STM32_TRACEERR_BADDEVGETSTATUS),
  TRACE_STR(STM32_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(STM32_TRACEERR_BADEPNO),
  TRACE_STR(STM32_TRACEERR_BADEPTYPE),
  TRACE_STR(STM32_TRACEERR_BADGETCONFIG),
  TRACE_STR(STM32_TRACEERR_BADGETSETDESC),
  TRACE_STR(STM32_TRACEERR_BADGETSTATUS),
  TRACE_STR(STM32_TRACEERR_BADSETADDRESS),
  TRACE_STR(STM32_TRACEERR_BADSETCONFIG),
  TRACE_STR(STM32_TRACEERR_BADSETFEATURE),
  TRACE_STR(STM32_TRACEERR_BINDFAILED),
  TRACE_STR(STM32_TRACEERR_DISPATCHSTALL),
  TRACE_STR(STM32_TRACEERR_DRIVER),
  TRACE_STR(STM32_TRACEERR_DRIVERREGISTERED),
  TRACE_STR(STM32_TRACEERR_EP0BADCTR),
  TRACE_STR(STM32_TRACEERR_EP0SETUPSTALLED),
  TRACE_STR(STM32_TRACEERR_EPBUFFER),
  TRACE_STR(STM32_TRACEERR_EPDISABLED),
  TRACE_STR(STM32_TRACEERR_EPOUTNULLPACKET),
  TRACE_STR(STM32_TRACEERR_EPRESERVE),
  TRACE_STR(STM32_TRACEERR_INVALIDCTRLREQ),
  TRACE_STR(STM32_TRACEERR_INVALIDPARMS),
  TRACE_STR(STM32_TRACEERR_IRQREGISTRATION),
  TRACE_STR(STM32_TRACEERR_NOTCONFIGURED),
  TRACE_STR(STM32_TRACEERR_REQABORTED),
  TRACE_STR_END
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32l4_getreg
 ****************************************************************************/

#ifdef CONFIG_STM32L4_USBDEV_REGDEBUG
static uint16_t stm32l4_getreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint16_t preval = 0;
  static uint32_t count = 0;

  /* Read the value from the register */

  uint16_t val = getreg16(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              uinfo("...\n");
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

