apache/nuttx/arch/arm/src/stm32l4/stm32l4_usbdev.c
      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          uinfo("[repeats %d more times]\n", count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = val;
      count    = 1;
    }

  /* Show the register value read */

  uinfo("%08" PRIx32 "->%04x\n", addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: stm32l4_putreg
 ****************************************************************************/

#ifdef CONFIG_STM32L4_USBDEV_REGDEBUG
static void stm32l4_putreg(uint16_t val, uint32_t addr)
{
  /* Show the register value being written */

  uinfo("%08" PRIx32 "<-%04x\n", addr, val);

  /* Write the value */

  putreg16(val, addr);
}
#endif

/****************************************************************************
 * Name: stm32l4_dumpep
 ****************************************************************************/

#ifdef CONFIG_STM32L4_USBDEV_REGDEBUG
static void stm32l4_dumpep(int epno)
{
  uint32_t addr;

  /* Common registers */

  uinfo("CNTR:   %04x\n", getreg16(STM32_USB_CNTR));
  uinfo("ISTR:   %04x\n", getreg16(STM32_USB_ISTR));
  uinfo("FNR:    %04x\n", getreg16(STM32_USB_FNR));
  uinfo("DADDR:  %04x\n", getreg16(STM32_USB_DADDR));
  uinfo("BTABLE: %04x\n", getreg16(STM32_USB_BTABLE));

  /* Endpoint register */

  addr = STM32_USB_EPR(epno);
  uinfo("EPR%d:   [%08" PRIx32 "] %04x\n", epno, addr, getreg16(addr));

  /* Endpoint descriptor */

  addr = STM32_USB_BTABLE_ADDR(epno, 0);
  uinfo("DESC:   %08" PRIx32 "\n", addr);

  /* Endpoint buffer descriptor */

  addr = STM32_USB_ADDR_TX(epno);
  uinfo("  TX ADDR:  [%08" PRIx32 "] %04x\n",  addr, getreg16(addr));

  addr = STM32_USB_COUNT_TX(epno);
  uinfo("     COUNT: [%08" PRIx32 "] %04x\n",  addr, getreg16(addr));

  addr = STM32_USB_ADDR_RX(epno);
  uinfo("  RX ADDR:  [%08" PRIx32 "] %04x\n",  addr, getreg16(addr));

  addr = STM32_USB_COUNT_RX(epno);
  uinfo("     COUNT: [%08" PRIx32 "] %04x\n",  addr, getreg16(addr));
}
#endif

/****************************************************************************
 * Name: stm32l4_checksetup
 ****************************************************************************/

#ifdef CONFIG_STM32L4_USBDEV_REGDEBUG
static void stm32l4_checksetup(void)
{
  uint32_t cfgr     = getreg32(STM32_RCC_CFGR);
  uint32_t apb1rstr = getreg32(STM32_RCC_APB1RSTR1);
  uint32_t apb1enr  = getreg32(STM32_RCC_APB1ENR1);

  uinfo("CFGR: %08" PRIx32 " APB1RSTR1: %08" PRIx32
        " APB1ENR1: %08" PRIx32 "\n", cfgr, apb1rstr,
        apb1enr);

  if ((apb1rstr & RCC_APB1RSTR1_USBFSRST) != 0 ||
      (apb1enr & RCC_APB1ENR1_USBFSEN) == 0)
    {
      uerr("ERROR: USB is NOT setup correctly\n");
    }
}
#endif

/****************************************************************************
 * Name: stm32l4_seteptxcount
 ****************************************************************************/

static inline void stm32l4_seteptxcount(uint8_t epno, uint16_t count)
{
  volatile uint16_t *epaddr = (uint16_t *)STM32_USB_COUNT_TX(epno);
  *epaddr = count;
}

/****************************************************************************
 * Name: stm32l4_seteptxaddr
 ****************************************************************************/

static inline void stm32l4_seteptxaddr(uint8_t epno, uint16_t addr)
{
  volatile uint16_t *txaddr = (uint16_t *)STM32_USB_ADDR_TX(epno);
  *txaddr = addr;
}

/****************************************************************************
 * Name: stm32l4_geteptxaddr
 ****************************************************************************/

static inline uint16_t stm32l4_geteptxaddr(uint8_t epno)
{
  volatile uint16_t *txaddr = (uint16_t *)STM32_USB_ADDR_TX(epno);
  return (uint16_t)*txaddr;
}

/****************************************************************************
 * Name: stm32l4_seteprxcount
 ****************************************************************************/

static void stm32l4_seteprxcount(uint8_t epno, uint16_t count)
{
  volatile uint16_t *epaddr = (uint16_t *)STM32_USB_COUNT_RX(epno);
  uint32_t rxcount = 0;
  uint16_t nblocks;

  /* The upper bits of the RX COUNT value contain the size of allocated
   * RX buffer.  This is based on a block size of 2 or 32:
   *
   * USB_COUNT_RX_BL_SIZE not set:
   *   nblocks is in units of 2 bytes.
   *     00000 - not allowed
   *     00001 - 2 bytes
   *     ....
   *     11111 - 62 bytes
   *
   * USB_COUNT_RX_BL_SIZE set:
   *     00000 - 32 bytes
   *     00001 - 64 bytes
   *     ...
   *     01111 - 512 bytes
   *     1xxxx - Not allowed
   */

  if (count > 62)
    {
      /* Blocks of 32 (with 0 meaning one block of 32) */

      nblocks = (count >> 5) - 1 ;
      DEBUGASSERT(nblocks <= 0x0f);
      rxcount = (uint32_t)((nblocks << USB_COUNT_RX_NUM_BLOCK_SHIFT) |
                USB_COUNT_RX_BL_SIZE);
    }
  else if (count > 0)
    {
      /* Blocks of 2 (with 1 meaning one block of 2) */

      nblocks = (count + 1) >> 1;
      DEBUGASSERT(nblocks > 0 && nblocks < 0x1f);
      rxcount = (uint32_t)(nblocks << USB_COUNT_RX_NUM_BLOCK_SHIFT);
    }

  *epaddr = rxcount;
}

/****************************************************************************
 * Name: stm32l4_geteprxcount
 ****************************************************************************/

static inline uint16_t stm32l4_geteprxcount(uint8_t epno)
{
  volatile uint16_t *epaddr = (uint16_t *)STM32_USB_COUNT_RX(epno);
  return (*epaddr) & USB_COUNT_RX_MASK;
}

/****************************************************************************
 * Name: stm32l4_seteprxaddr
 ****************************************************************************/

static inline void stm32l4_seteprxaddr(uint8_t epno, uint16_t addr)
{
  volatile uint16_t *rxaddr = (uint16_t *)STM32_USB_ADDR_RX(epno);
  *rxaddr = addr;
}

/****************************************************************************
 * Name: stm32l4_seteprxaddr
 ****************************************************************************/

static inline uint16_t stm32l4_geteprxaddr(uint8_t epno)
{
  volatile uint16_t *rxaddr = (uint16_t *)STM32_USB_ADDR_RX(epno);
  return (uint16_t)*rxaddr;
}

/****************************************************************************
 * Name: stm32l4_setepaddress
 ****************************************************************************/

static inline void stm32l4_setepaddress(uint8_t epno, uint16_t addr)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

