apache/nuttx/arch/arm/src/stm32l4/stm32l4_usbdev.c
  regval  = stm32l4_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_EA_MASK;
  regval |= (addr << USB_EPR_EA_SHIFT);
  stm32l4_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32l4_seteptype
 ****************************************************************************/

static inline void stm32l4_seteptype(uint8_t epno, uint16_t type)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  regval  = stm32l4_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_EPTYPE_MASK;
  regval |= type;
  stm32l4_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32l4_setstatusout
 ****************************************************************************/

static inline void stm32l4_setstatusout(uint8_t epno)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  /* For a BULK endpoint the EP_KIND bit is used to enabled double buffering;
   * for a CONTROL endpoint, it is set to indicate that a status OUT
   * transaction is expected.  The bit is not used with out endpoint types.
   */

  regval  = stm32l4_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval |= USB_EPR_EP_KIND;
  stm32l4_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32l4_clrstatusout
 ****************************************************************************/

static inline void stm32l4_clrstatusout(uint8_t epno)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  /* For a BULK endpoint the EP_KIND bit is used to enabled double buffering;
   * for a CONTROL endpoint, it is set to indicate that a status OUT
   * transaction is expected.  The bit is not used with out endpoint types.
   */

  regval  = stm32l4_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_EP_KIND;
  stm32l4_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32l4_clrrxdtog
 ****************************************************************************/

static void stm32l4_clrrxdtog(uint8_t epno)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  regval = stm32l4_getreg(epaddr);
  if ((regval & USB_EPR_DTOG_RX) != 0)
    {
      regval &= EPR_NOTOG_MASK;
      regval |= USB_EPR_DTOG_RX;
      stm32l4_putreg(regval, epaddr);
    }
}

/****************************************************************************
 * Name: stm32l4_clrtxdtog
 ****************************************************************************/

static void stm32l4_clrtxdtog(uint8_t epno)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  regval = stm32l4_getreg(epaddr);
  if ((regval & USB_EPR_DTOG_TX) != 0)
    {
      regval &= EPR_NOTOG_MASK;
      regval |= USB_EPR_DTOG_TX;
      stm32l4_putreg(regval, epaddr);
    }
}

/****************************************************************************
 * Name: stm32l4_clrepctrrx
 ****************************************************************************/

static void stm32l4_clrepctrrx(uint8_t epno)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  regval  = stm32l4_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_CTR_RX;
  stm32l4_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32l4_clrepctrtx
 ****************************************************************************/

static void stm32l4_clrepctrtx(uint8_t epno)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  regval  = stm32l4_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_CTR_TX;
  stm32l4_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32l4_geteptxstatus
 ****************************************************************************/

static inline uint16_t stm32l4_geteptxstatus(uint8_t epno)
{
  return (uint16_t)(stm32l4_getreg(STM32_USB_EPR(epno)) &
                    USB_EPR_STATTX_MASK);
}

/****************************************************************************
 * Name: stm32l4_geteprxstatus
 ****************************************************************************/

static inline uint16_t stm32l4_geteprxstatus(uint8_t epno)
{
  return (stm32l4_getreg(STM32_USB_EPR(epno)) & USB_EPR_STATRX_MASK);
}

/****************************************************************************
 * Name: stm32l4_seteptxstatus
 ****************************************************************************/

static void stm32l4_seteptxstatus(uint8_t epno, uint16_t state)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  /* The bits in the STAT_TX field can be toggled by software to set their
   * value. When set to 0, the value remains unchanged; when set to one,
   * value toggles.
   */

  regval = stm32l4_getreg(epaddr);

  /* The exclusive OR will set STAT_TX bits to 1 if there value is different
   * from the bits requested in 'state'
   */

  regval ^= state;
  regval &= EPR_TXDTOG_MASK;
  stm32l4_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32l4_seteprxstatus
 ****************************************************************************/

static void stm32l4_seteprxstatus(uint8_t epno, uint16_t state)
{
  uint32_t epaddr = STM32_USB_EPR(epno);
  uint16_t regval;

  /* The bits in the STAT_RX field can be toggled by software to set their
   * value. When set to 0, the value remains unchanged; when set to one,
   * value toggles.
   */

  regval = stm32l4_getreg(epaddr);

  /* The exclusive OR will set STAT_RX bits to 1 if there value is different
   * from the bits requested in 'state'
   */

  regval ^= state;
  regval &= EPR_RXDTOG_MASK;
  stm32l4_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32l4_eptxstalled
 ****************************************************************************/

