apache/nuttx/arch/arm/src/stm32l4/stm32l4_usbdev.c
static inline bool stm32l4_eptxstalled(uint8_t epno)
{
  return (stm32l4_geteptxstatus(epno) == USB_EPR_STATTX_STALL);
}

/****************************************************************************
 * Name: stm32l4_eprxstalled
 ****************************************************************************/

static inline bool stm32l4_eprxstalled(uint8_t epno)
{
  return (stm32l4_geteprxstatus(epno) == USB_EPR_STATRX_STALL);
}

/****************************************************************************
 * Name: stm32l4_copytopma
 ****************************************************************************/

static void stm32l4_copytopma(const uint8_t *buffer, uint16_t pma,
                              uint16_t nbytes)
{
  volatile uint16_t *dest;
  uint16_t ms;
  uint16_t ls;
  int     nwords = (nbytes + 1) >> 1;
  int     i;

  /* Copy loop.  Source=user buffer, Dest=packet memory */

  dest = (volatile uint16_t *)(STM32_USB_SRAM_BASE + (uint32_t)pma);
  for (i = nwords; i != 0; i--)
    {
      /* Read two bytes and pack into on 16-bit word */

      ls = (uint16_t)(*buffer++);
      ms = (uint16_t)(*buffer++);
      *dest = ms << 8 | ls;

      /* Source address increments by 2*sizeof(uint8_t) = 2; Dest address
       * increments by 1*sizeof(uint16_t) = 2.
       */

      dest += 1;
    }
}

/****************************************************************************
 * Name: stm32l4_copyfrompma
 ****************************************************************************/

static inline void
stm32l4_copyfrompma(uint8_t *buffer, uint16_t pma, uint16_t nbytes)
{
  volatile uint16_t *src;
  int nwords = (nbytes + 1) >> 1;
  int i;

  /* Copy loop.  Source=packet memory, Dest=user buffer */

  src = (volatile uint16_t *)(STM32_USB_SRAM_BASE + (uint32_t)pma);
  for (i = nwords; i != 0; i--)
    {
      /* Copy 16-bits from packet memory to user buffer. */

      *(uint16_t *)buffer = *src++;

      /* Source address increments by 1*sizeof(uint16_t) = 2; Dest address
       * increments by 2*sizeof(uint8_t) = 2.
       */

      buffer += 2;
    }
}

/****************************************************************************
 * Name: stm32l4_rqdequeue
 ****************************************************************************/

static struct stm32l4_req_s *stm32l4_rqdequeue(struct stm32l4_ep_s *privep)
{
  struct stm32l4_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: stm32l4_rqenqueue
 ****************************************************************************/

static void stm32l4_rqenqueue(struct stm32l4_ep_s *privep,
                              struct stm32l4_req_s *req)
{
  req->flink = NULL;
  if (!privep->head)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail        = req;
    }
}

/****************************************************************************
 * Name: stm32l4_abortrequest
 ****************************************************************************/

static inline void
stm32l4_abortrequest(struct stm32l4_ep_s *privep,
                     struct stm32l4_req_s *privreq, int16_t result)
{
  usbtrace(TRACE_DEVERROR(STM32_TRACEERR_REQABORTED),
           (uint16_t)USB_EPNO(privep->ep.eplog));

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);
}

/****************************************************************************
 * Name: stm32l4_reqcomplete
 ****************************************************************************/

static void stm32l4_reqcomplete(struct stm32l4_ep_s *privep, int16_t result)
{
  struct stm32l4_req_s *privreq;
  irqstate_t flags;

  /* Remove the completed request at the head of the endpoint request list */

  flags = enter_critical_section();
  privreq = stm32l4_rqdequeue(privep);
  leave_critical_section(flags);

  if (privreq)
    {
      /* If endpoint 0, temporarily reflect the state of protocol stalled
       * in the callback.
       */

      bool stalled = privep->stalled;
      if (USB_EPNO(privep->ep.eplog) == EP0)
        {
          privep->stalled = (privep->dev->ep0state == EP0STATE_STALLED);
        }

      /* Save the result in the request structure */

      privreq->req.result = result;

      /* Callback to the request completion handler */

      privreq->flink = NULL;
      privreq->req.callback(&privep->ep, &privreq->req);

      /* Restore the stalled indication */

      privep->stalled = stalled;
    }
}

/****************************************************************************
 * Name: tm32_epwrite
 ****************************************************************************/

static void stm32l4_epwrite(struct stm32l4_usbdev_s *priv,
                          struct stm32l4_ep_s *privep,
                          const uint8_t *buf, uint32_t nbytes)
{
  uint8_t epno = USB_EPNO(privep->ep.eplog);
  usbtrace(TRACE_WRITE(epno), nbytes);

  /* Check for a zero-length packet */

  if (nbytes > 0)
    {
      /* Copy the data from the user buffer into packet memory for this
       * endpoint
       */

      stm32l4_copytopma(buf, stm32l4_geteptxaddr(epno), nbytes);
    }

  /* Send the packet (might be a null packet nbytes == 0) */

  stm32l4_seteptxcount(epno, nbytes);
  priv->txstatus = USB_EPR_STATTX_VALID;

  /* Indicate that there is data in the TX packet memory.  This will be
   * cleared when the next data out interrupt is received.
   */

  privep->txbusy = true;
}

/****************************************************************************
 * Name: stm32l4_wrrequest_ep0
 *
 * Description:
 *   Handle the ep0 state on writes.
 *
 ****************************************************************************/

inline static int stm32l4_wrrequest_ep0(struct stm32l4_usbdev_s *priv,
                                      struct stm32l4_ep_s *privep)
{
  int ret;
  ret = stm32l4_wrrequest(priv, privep);
  priv->ep0state = ((ret == OK) ? EP0STATE_WRREQUEST : EP0STATE_IDLE);
  return ret;
}

/****************************************************************************
 * Name: stm32l4_wrrequest
 ****************************************************************************/

static int stm32l4_wrrequest(struct stm32l4_usbdev_s *priv,
                             struct stm32l4_ep_s *privep)
{
  struct stm32l4_req_s *privreq;
  uint8_t *buf;
  uint8_t epno;
  int nbytes;
  int bytesleft;

  /* We get here when an IN endpoint interrupt occurs.  So now we know that
   * there is no TX transfer in progress.
   */

  privep->txbusy = false;

  /* Check the request from the head of the endpoint request queue */

  privreq = stm32l4_rqpeek(privep);
  if (!privreq)
    {
      /* There is no TX transfer in progress and no new pending TX
       * requests to send.
       */

